{"sample_weight_mode": null, "config": {"name": "model_1", "input_layers": [["char_input", 0, 0]], "layers": [{"name": "char_input", "class_name": "InputLayer", "config": {"name": "char_input", "input_dtype": "float32", "batch_input_shape": [null, 27, 28]}, "inbound_nodes": []}, {"name": "left_enc_lstm_1", "class_name": "LSTM", "config": {"input_dim": 28, "dropout_U": 0.0, "go_backwards": false, "inner_activation": "hard_sigmoid", "U_regularizer": null, "activation": "tanh", "name": "left_enc_lstm_1", "return_sequences": true, "input_length": null, "inner_init": "orthogonal", "stateful": false, "init": "glorot_uniform", "W_regularizer": null, "unroll": false, "output_dim": 300, "b_regularizer": null, "dropout_W": 0.0, "trainable": true, "forget_bias_init": "one", "consume_less": "cpu"}, "inbound_nodes": [[["char_input", 0, 0]]]}, {"name": "right_enc_lstm_1", "class_name": "LSTM", "config": {"input_dim": 28, "dropout_U": 0.0, "go_backwards": true, "inner_activation": "hard_sigmoid", "U_regularizer": null, "activation": "tanh", "name": "right_enc_lstm_1", "return_sequences": true, "input_length": null, "inner_init": "orthogonal", "stateful": false, "init": "glorot_uniform", "W_regularizer": null, "unroll": false, "output_dim": 300, "b_regularizer": null, "dropout_W": 0.0, "trainable": true, "forget_bias_init": "one", "consume_less": "cpu"}, "inbound_nodes": [[["char_input", 0, 0]]]}, {"name": "encoder_1", "class_name": "Merge", "config": {"dot_axes": [-1, -1], "concat_axis": -1, "name": "encoder_1", "mode": "sum", "mode_type": "raw", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["left_enc_lstm_1", 0, 0], ["right_enc_lstm_1", 0, 0]]]}, {"name": "left_enc_lstm_2", "class_name": "LSTM", "config": {"input_dim": 300, "dropout_U": 0.0, "go_backwards": false, "inner_activation": "hard_sigmoid", "U_regularizer": null, "activation": "tanh", "name": "left_enc_lstm_2", "return_sequences": true, "input_length": null, "inner_init": "orthogonal", "stateful": false, "init": "glorot_uniform", "W_regularizer": null, "unroll": false, "output_dim": 300, "b_regularizer": null, "dropout_W": 0.0, "trainable": true, "forget_bias_init": "one", "consume_less": "cpu"}, "inbound_nodes": [[["encoder_1", 0, 0]]]}, {"name": "right_enc_lstm_2", "class_name": "LSTM", "config": {"input_dim": 300, "dropout_U": 0.0, "go_backwards": true, "inner_activation": "hard_sigmoid", "U_regularizer": null, "activation": "tanh", "name": "right_enc_lstm_2", "return_sequences": true, "input_length": null, "inner_init": "orthogonal", "stateful": false, "init": "glorot_uniform", "W_regularizer": null, "unroll": false, "output_dim": 300, "b_regularizer": null, "dropout_W": 0.0, "trainable": true, "forget_bias_init": "one", "consume_less": "cpu"}, "inbound_nodes": [[["encoder_1", 0, 0]]]}, {"name": "encoder_2", "class_name": "Merge", "config": {"dot_axes": [-1, -1], "concat_axis": -1, "name": "encoder_2", "mode": "sum", "mode_type": "raw", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["left_enc_lstm_2", 0, 0], ["right_enc_lstm_2", 0, 0]]]}, {"name": "left_enc_lstm_3", "class_name": "LSTM", "config": {"input_dim": 300, "dropout_U": 0.0, "go_backwards": false, "inner_activation": "hard_sigmoid", "U_regularizer": null, "activation": "tanh", "name": "left_enc_lstm_3", "return_sequences": true, "input_length": null, "inner_init": "orthogonal", "stateful": false, "init": "glorot_uniform", "W_regularizer": null, "unroll": false, "output_dim": 300, "b_regularizer": null, "dropout_W": 0.0, "trainable": true, "forget_bias_init": "one", "consume_less": "cpu"}, "inbound_nodes": [[["encoder_2", 0, 0]]]}, {"name": "right_enc_lstm_3", "class_name": "LSTM", "config": {"input_dim": 300, "dropout_U": 0.0, "go_backwards": true, "inner_activation": "hard_sigmoid", "U_regularizer": null, "activation": "tanh", "name": "right_enc_lstm_3", "return_sequences": true, "input_length": null, "inner_init": "orthogonal", "stateful": false, "init": "glorot_uniform", "W_regularizer": null, "unroll": false, "output_dim": 300, "b_regularizer": null, "dropout_W": 0.0, "trainable": true, "forget_bias_init": "one", "consume_less": "cpu"}, "inbound_nodes": [[["encoder_2", 0, 0]]]}, {"name": "encoder_3", "class_name": "Merge", "config": {"dot_axes": [-1, -1], "concat_axis": -1, "name": "encoder_3", "mode": "sum", "mode_type": "raw", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["left_enc_lstm_3", 0, 0], ["right_enc_lstm_3", 0, 0]]]}, {"name": "dense", "class_name": "TimeDistributed", "config": {"name": "dense", "layer": {"class_name": "Dense", "config": {"input_dim": null, "output_dim": 3, "activation": "linear", "name": "dense_1", "b_regularizer": null, "activity_regularizer": null, "trainable": true, "b_constraint": null, "W_regularizer": null, "W_constraint": null, "bias": true, "init": "glorot_uniform"}}, "trainable": true}, "inbound_nodes": [[["encoder_3", 0, 0]]]}, {"name": "out", "class_name": "Activation", "config": {"name": "out", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dense", 0, 0]]]}], "output_layers": [["out", 0, 0]]}, "loss_weights": null, "keras_version": "1.0.4", "optimizer": {"lr": 0.0010000000474974513, "name": "RMSprop", "epsilon": 1e-08, "rho": 0.8999999761581421}, "class_name": "Model", "loss": {"out": "categorical_crossentropy"}}